### 1. Mean

In [1]:
import pandas as pd
import numpy as np

kolom = {'col1':[2, 9, 19],
         'col2':[5, np.nan, 17],
         'col3':[3, 9, np.nan],
         'col4':[6, 0, 9],
         'col5':[np.nan, 7, np.nan]}

data = pd.DataFrame(kolom)

In [2]:
data

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   NaN
1     9   NaN   9.0     0   7.0
2    19  17.0   NaN     9   NaN

In [3]:
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   7.0
1     9  11.0   9.0     0   7.0
2    19  17.0   6.0     9   7.0

### 2. Nilai suka suka

In [4]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}
data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [5]:
data.fillna(99)

   umur
0  29.0
1  43.0
2  99.0
3  25.0
4  34.0
5  99.0
6  50.0

### 3. End of tail

In [6]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}
data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [12]:
pip install feature-engine

Requirement already satisfied: feature-engine in c:\users\67201\anaconda3\lib\site-packages (1.2.0)
Requirement already satisfied: pandas>=1.0.3 in c:\users\67201\anaconda3\lib\site-packages (from feature-engine) (1.3.4)
Requirement already satisfied: scipy>=1.4.1 in c:\users\67201\anaconda3\lib\site-packages (from feature-engine) (1.7.1)
Requirement already satisfied: numpy>=1.18.2 in c:\users\67201\anaconda3\lib\site-packages (from feature-engine) (1.20.3)
Requirement already satisfied: scikit-learn>=0.22.2 in c:\users\67201\anaconda3\lib\site-packages (from feature-engine) (0.24.2)
Requirement already satisfied: statsmodels>=0.11.1 in c:\users\67201\anaconda3\lib\site-packages (from feature-engine) (0.12.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\67201\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\67201\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\67201\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=1.0.3->feature-engine) (1.16.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\67201\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (2.2.0)
Requirement already satisfied: joblib>=0.11 in c:\users\67201\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (1.1.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: patsy>=0.5 in c:\users\67201\anaconda3\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (0.5.2)

In [14]:
from feature_engine.imputation import EndTailImputer

imputer= EndTailImputer(imputation_method='gaussian', tail='right')


imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#tampilan
test_data

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

#### 4. imputasi modus

In [18]:
from sklearn.impute import SimpleImputer
mobil = {'mobil':['Ford', 'Ford' 'Toyota', 'Honda', np.nan, 'Toyota', 'Honda', 'Toyota', np.nan, np.nan]}

data = pd.DataFrame(mobil)

In [16]:
data

        mobil
0        Ford
1  FordToyota
2       Honda
3         NaN
4      Toyota
5       Honda
6      Toyota
7         NaN
8         NaN

In [19]:
imp = SimpleImputer(strategy='most_frequent')

In [21]:
imp.fit_transform(data)

array([['Ford'],
       ['FordToyota'],
       ['Honda'],
       ['Honda'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Honda'],
       ['Honda']], dtype=object)

### 5. random sample

In [28]:
from feature_engine.imputation import RandomSampleImputer

data = {'Jenis Kelamin':['Laki-laki', 'Perempuan', np.nan, 'Laki-Laki', 'Perempuan', np.nan, 'Laki-Laki', np.nan, 'Perempuan', 'Laki-Laki'],
        'Umur': [30, np.nan, 33, 48, 55, 20, np.nan, 29, np.nan, 37]}

df = pd.DataFrame(data)

In [29]:
df

  Jenis Kelamin  Umur
0     Laki-laki  30.0
1     Perempuan   NaN
2           NaN  33.0
3     Laki-Laki  48.0
4     Perempuan  55.0
5           NaN  20.0
6     Laki-Laki   NaN
7           NaN  29.0
8     Perempuan   NaN
9     Laki-Laki  37.0

In [30]:
imputer = RandomSampleImputer(random_state=29)

imputer.fit(df)

testing_df = imputer.transform(df)

In [31]:
testing_df

  Jenis Kelamin  Umur
0     Laki-laki  30.0
1     Perempuan  29.0
2     Perempuan  33.0
3     Laki-Laki  48.0
4     Perempuan  55.0
5     Perempuan  20.0
6     Laki-Laki  55.0
7     Laki-Laki  29.0
8     Perempuan  20.0
9     Laki-Laki  37.0